tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "autoconf"
brew "automake"
brew "bashdb"
brew "borgbackup"
brew "choose-gui"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "fd"
brew "gcc"
brew "gnuplot"
brew "pkg-config"
brew "libgccjit"
brew "openjdk"
brew "poppler"
brew "ripgrep"
brew "shellcheck"
brew "zshdb"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-modern-doom3-icon"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qmk/qmk/qmk"
cask "anki"
cask "bitwarden"
cask "blender"
cask "clion"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-ibm-plex-mono"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-overpass"
cask "font-overpass-mono"
cask "font-overpass-nerd-font"
cask "font-roboto-mono"
cask "gimp"
cask "inkscape"
cask "kitty"
cask "mactex"
cask "pycharm"
cask "qmk-toolbox"
cask "spotify"
cask "tor-browser"
cask "ultimaker-cura"
