tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "autoconf"
brew "automake"
brew "bashdb"
brew "coreutils"
brew "bats-core"
brew "borgbackup"
brew "gcc"
brew "choose-gui"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "fd"
brew "ffmpeg"
brew "gnuplot"
brew "graphviz"
brew "grep"
brew "pkg-config"
brew "jq"
brew "libgccjit"
brew "libvterm"
brew "llvm"
brew "mas"
brew "neofetch"
brew "opencv"
brew "openjdk"
brew "pngpaste"
brew "poppler"
brew "ranger"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "zshdb"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-doom3-icon", "with-native-comp", "with-no-frame-refocus", "with-xwidgets"]
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "anki"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "barrier"
cask "bitwarden"
cask "blender"
cask "clion"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ibm-plex"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-mononoki"
cask "font-overpass"
cask "font-overpass-mono"
cask "font-overpass-nerd-font"
cask "font-roboto-mono"
cask "gimp"
cask "inkscape"
cask "kitty"
cask "librewolf"
cask "mactex"
cask "obs"
cask "pycharm"
cask "qmk-toolbox"
cask "sf-symbols"
cask "spacelauncher"
cask "spotify"
cask "tor-browser"
cask "ultimaker-cura"
cask "utm"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
